app/Controllers/Gitars.php

SELECT *
FROM `gitars`
---
    public function index()
    {
        $data = [
            'title' => 'Daftar Gitar',
            'gitars' => $this->gitarsModel->findAll()

INSERT INTO `gitars` (`nama_produk`, `merek`, `jenis`, `harga`, `stok`) VALUES ('wftrj', '54uytyw', 'swdh', '12122', '5')
---
    public function create()
    {
        $this->gitarsModel->save([
            'nama_produk' => $this->request->getPost('nama_produk'),
            'merek' => $this->request->getPost('merek'),
            'jenis' => $this->request->getPost('jenis'),
            'harga' => $this->request->getPost('harga'),
            'stok' => $this->request->getPost('stok'),
        ]);

UPDATE `gitars` SET `nama_produk` = 'Gitar Akustik', `merek` = 'Yamaha  F310', `jenis` = 'Akustik', `harga` = '1500000.00', `stok` = '9'
WHERE `gitars`.`id_produk` IN ('1')
---
    public function update($id)
    {
        $this->gitarsModel->update($id, [
            'nama_produk' => $this->request->getPost('nama_produk'),
            'merek' => $this->request->getPost('merek'),
            'jenis' => $this->request->getPost('jenis'),
            'harga' => $this->request->getPost('harga'),
            'stok' => $this->request->getPost('stok'),
        ]);